# LightGroup Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LightGroup Members
LightGroup Class Methods Properties See Also
---
The LightGroup type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddLight | Add a new light instance to the group |
| Dispose | Releases all resources used by the LightGroup |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetLights | Get the set of contained light instances The set of light instances |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| RemoveLight | Remove the given light instance from the set of light instances in this group |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Id | The ElementId of the LightGroup |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Name | The name of the LightGroup |

# See Also
LightGroup Class
Autodesk.Revit.DB.Lighting Namespace